# -*- org-attach-id-dir: "../../../../files/attachments"; -*-
#+BEGIN_COMMENT
.. title: My mental model of setf was wrong
.. slug: my-mental-model-of-setf-was-wrong
.. date: 2024-07-27 14:29:18 UTC+01:00
.. tags: lisp, programming, macroprogramming
.. category:
.. link:
.. description:
.. type: text

#+END_COMMENT
** You can specialise by value too

     Since the ~setf~ forms are just methods, you could if you wanted to
     specialise them on the type of the new value as well as on the
     locator. As a trivial example:

     #+begin_src lisp :results output :exports both
(defmethod (setf assign-head) ((v integer) (l list))
  (format t "Assigned an integer ~s" v)
  (setf (car l) v))

(defmethod (setf assign-head) ((s string) (l list))
  (format t "Assigned a string ~s" s)
  (setf (car l) s))

(setf (assign-head '(1 2 3)) "zero")
     #+end_src

#+RESULTS:
: Assigned a string "zero"

     Obviously there are better ways to do this, but it's a good
     example of the flexibility that comes from ~setf~ not really being
     all that special a form at all: just a creative use of the power
     of generic functions.

